FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/Projects/MCUXpresso/Startup/startup_lpc54018.c
/****************************************************************************** */
/* LPC54018 startup code for use with MCUXpresso IDE */
/* */
/* Version : 101019 */
/****************************************************************************** */
/* */
/* Copyright 2016-2019 NXP */
/* All rights reserved. */
/* */
/* SPDX-License-Identifier: BSD-3-Clause */
/****************************************************************************** */

#if defined( DEBUG )
    #pragma GCC push_options
    #pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined( __cplusplus )
    #ifdef __REDLIB__
        #error Redlib does not support C++
    #else
/****************************************************************************** */
/* */
/* The entry point for the C++ library startup */
/* */
/****************************************************************************** */
    extern "C" {
    extern void __libc_init_array( void );
    }
    #endif
#endif /* if defined( __cplusplus ) */

#define WEAK       __attribute__( ( weak ) )
#define WEAK_AV    __attribute__( ( weak, section( ".after_vectors" ) ) )
#define ALIAS( f )    __attribute__( ( weak, alias(# f ) ) )

/****************************************************************************** */
#if defined( __cplusplus )
extern "C" {
#endif

/****************************************************************************** */
/* Variable to store CRP value in. Will be placed automatically */
/* by the linker when "Enable Code Read Protect" selected. */
/* See crp.h header for more information */
/****************************************************************************** */
#include <NXP/crp.h>
__CRP const unsigned int CRP_WORD = CRP_NO_CRP;

/****************************************************************************** */
/* Declaration of external SystemInit function */
/****************************************************************************** */
#if defined( __USE_CMSIS )
    extern void SystemInit( void );
#endif // (__USE_CMSIS)

/****************************************************************************** */
/* Forward declaration of the core exception handlers. */
/* When the application defines a handler (with the same name), this will */
/* automatically take precedence over these weak definitions. */
/* If your application is a C++ one, then any interrupt handlers defined */
/* in C++ files within in your main application will need to have C linkage */
/* rather than C++ linkage. To do this, make sure that you are using extern "C" */
/* { .... } around the interrupt handler within your main application code. */
/****************************************************************************** */
void ResetISR( void );
WEAK void NMI_Handler( void );
WEAK void HardFault_Handler( void );
WEAK void MemManage_Handler( void );
WEAK void BusFault_Handler( void );
WEAK void UsageFault_Handler( void );
WEAK void SVC_Handler( void );
WEAK void DebugMon_Handler( void );
WEAK void PendSV_Handler( void );
WEAK void SysTick_Handler( void );
WEAK void IntDefaultHandler( void );

/****************************************************************************** */
/* Forward declaration of the application IRQ handlers. When the application */
/* defines a handler (with the same name), this will automatically take */
/* precedence over weak definitions below */
/****************************************************************************** */
WEAK void WDT_BOD_IRQHandler( void );
WEAK void DMA0_IRQHandler( void );
WEAK void GINT0_IRQHandler( void );
WEAK void GINT1_IRQHandler( void );
WEAK void PIN_INT0_IRQHandler( void );
WEAK void PIN_INT1_IRQHandler( void );
WEAK void PIN_INT2_IRQHandler( void );
WEAK void PIN_INT3_IRQHandler( void );
WEAK void UTICK0_IRQHandler( void );
WEAK void MRT0_IRQHandler( void );
WEAK void CTIMER0_IRQHandler( void );
WEAK void CTIMER1_IRQHandler( void );
WEAK void SCT0_IRQHandler( void );
WEAK void CTIMER3_IRQHandler( void );
WEAK void FLEXCOMM0_IRQHandler( void );
WEAK void FLEXCOMM1_IRQHandler( void );
WEAK void FLEXCOMM2_IRQHandler( void );
WEAK void FLEXCOMM3_IRQHandler( void );
WEAK void FLEXCOMM4_IRQHandler( void );
WEAK void FLEXCOMM5_IRQHandler( void );
WEAK void FLEXCOMM6_IRQHandler( void );
WEAK void FLEXCOMM7_IRQHandler( void );
WEAK void ADC0_SEQA_IRQHandler( void );
WEAK void ADC0_SEQB_IRQHandler( void );
WEAK void ADC0_THCMP_IRQHandler( void );
WEAK void DMIC0_IRQHandler( void );
WEAK void HWVAD0_IRQHandler( void );
WEAK void USB0_NEEDCLK_IRQHandler( void );
WEAK void USB0_IRQHandler( void );
WEAK void RTC_IRQHandler( void );
WEAK void FLEXCOMM10_IRQHandler( void );
WEAK void Reserved47_IRQHandler( void );
WEAK void PIN_INT4_IRQHandler( void );
WEAK void PIN_INT5_IRQHandler( void );
WEAK void PIN_INT6_IRQHandler( void );
WEAK void PIN_INT7_IRQHandler( void );
WEAK void CTIMER2_IRQHandler( void );
WEAK void CTIMER4_IRQHandler( void );
WEAK void RIT_IRQHandler( void );
WEAK void SPIFI0_IRQHandler( void );
WEAK void FLEXCOMM8_IRQHandler( void );
WEAK void FLEXCOMM9_IRQHandler( void );
WEAK void SDIO_IRQHandler( void );
WEAK void CAN0_IRQ0_IRQHandler( void );
WEAK void CAN0_IRQ1_IRQHandler( void );
WEAK void CAN1_IRQ0_IRQHandler( void );
WEAK void CAN1_IRQ1_IRQHandler( void );
WEAK void USB1_IRQHandler( void );
WEAK void USB1_NEEDCLK_IRQHandler( void );
WEAK void ETHERNET_IRQHandler( void );
WEAK void ETHERNET_PMT_IRQHandler( void );
WEAK void ETHERNET_MACLP_IRQHandler( void );
WEAK void Reserved68_IRQHandler( void );
WEAK void LCD_IRQHandler( void );
WEAK void SHA_IRQHandler( void );
WEAK void SMARTCARD0_IRQHandler( void );
WEAK void SMARTCARD1_IRQHandler( void );

/****************************************************************************** */
/* Forward declaration of the driver IRQ handlers. These are aliased */
/* to the IntDefaultHandler, which is a 'forever' loop. When the driver */
/* defines a handler (with the same name), this will automatically take */
/* precedence over these weak definitions */
/****************************************************************************** */
void WDT_BOD_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void DMA0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void GINT0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void GINT1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT2_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT3_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void UTICK0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void MRT0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CTIMER0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CTIMER1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SCT0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CTIMER3_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM2_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM3_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM4_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM5_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM6_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM7_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ADC0_SEQA_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ADC0_SEQB_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ADC0_THCMP_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void DMIC0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void HWVAD0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void USB0_NEEDCLK_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void USB0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void RTC_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM10_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void Reserved47_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT4_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT5_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT6_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void PIN_INT7_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CTIMER2_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CTIMER4_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void RIT_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SPIFI0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM8_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void FLEXCOMM9_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SDIO_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CAN0_IRQ0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CAN0_IRQ1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CAN1_IRQ0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void CAN1_IRQ1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void USB1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void USB1_NEEDCLK_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ETHERNET_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ETHERNET_PMT_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void ETHERNET_MACLP_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void Reserved68_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void LCD_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SHA_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SMARTCARD0_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );
void SMARTCARD1_DriverIRQHandler( void ) ALIAS( IntDefaultHandler );

/****************************************************************************** */
/* The entry point for the application. */
/* __main() is the entry point for Redlib based applications */
/* main() is the entry point for Newlib based applications */
/****************************************************************************** */
#if defined( __REDLIB__ )
    extern void __main( void );
#endif
extern int main( void );

/****************************************************************************** */
/* External declaration for the pointer to the stack top from the Linker Script */
/****************************************************************************** */
extern void _vStackTop( void );
extern void _image_size( void );
/****************************************************************************** */
/* External declaration for LPC MCU vector table checksum from  Linker Script */
/****************************************************************************** */
WEAK extern void __valid_user_code_checksum();

/****************************************************************************** */
/* External declaration for image type and load address from  Linker Script */
/****************************************************************************** */
WEAK extern void __imghdr_loadaddress();
WEAK extern void __imghdr_imagetype();

/****************************************************************************** */
#if defined( __cplusplus )
} /* extern "C" */
#endif
#ifndef IMG_BAUDRATE
    #define IMG_BAUDRATE    0
#endif
/****************************************************************************** */
/* The vector table. */
/* This relies on the linker script to place at correct location in memory. */
/****************************************************************************** */
extern void( *const g_pfnVectors[] )( void );
extern void * __Vectors __attribute__( ( alias( "g_pfnVectors" ) ) );

