FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/Projects/MCUXpresso/Startup/startup_lpc54018.c
    #if defined( ADD_CRC )
        ( __imghdr_imagetype - 1 ),                             /* (0x04) Image Type */
        __imghdr_loadaddress,                                   /* (0x08) Load_address */
    #else
        __imghdr_imagetype,                                     /* (0x04) Image Type */
        __imghdr_loadaddress,                                   /* (0x08) Load_address */
    #endif
    ( void ( * )( void ) )( ( ( unsigned ) _image_size ) - 4 ), /* (0x0C) load_length, exclude 4 bytes CRC field. */
    0,                                                          /* (0x10) CRC value (only applicable to NON Non-secure images). */
    0,                                                          /* (0x14) Version (only applicable to DUAL_ENH image type. */
    0,                                                          /* (0x18) EMC static memory configuration settings, required for EMC boot */
    ( void ( * )( void ) )IMG_BAUDRATE,                         /* (0x1C) image baudrate */
    0,                                                          /* (0x20) reserved */
    ( void ( * )( void ) ) 0xEDDC94BD,                          /* (0x24) Image_marker */
    0,                                                          /* (0x28) SBZ */
    0,                                                          /* (0x2C) reserved */
    #ifdef W25Q128JVFM
        /* SPIFI Descriptor - W25Q128JVFM */
        ( void ( * )( void ) ) 0x00000000, /* 0xFFFFFFFF to default 1-bit SPI mode  ；DevStrAdr */
        ( void ( * )( void ) ) 0x001870EF, /* mfgId + extCount */
        ( void ( * )( void ) ) 0x00000000, /* extid 0-3 */
        ( void ( * )( void ) ) 0x00000000, /* extid 4-7 */
        ( void ( * )( void ) ) 0x0001001D, /* caps */
        ( void ( * )( void ) ) 0x00000100, /* Blks + RESV1 */
        ( void ( * )( void ) ) 0x00010000, /* blkSize */
        ( void ( * )( void ) ) 0x00000000, /* subBlks + subBlkSize */
        ( void ( * )( void ) ) 0x00000100, /* pageSize + RESV2 */
        ( void ( * )( void ) ) 0x00003F00, /* maxReadSize */
        ( void ( * )( void ) ) 0x68506850, /* maxClkRate,maxReadRate,maxHSReadRate,maxProgramRate */
        ( void ( * )( void ) ) 0x04030050, /* maxHSProgramRate,initDeInitFxId,clearStatusFxId,getStatusFxId, */
        ( void ( * )( void ) ) 0x14110D09, /* setStatusFxId,setOptionsFxId,getReadCmdFxId,getWriteCmdFxId */
    #endif /* ifdef W25Q128JVFM */

    #ifdef MXL12835F
        /* SPI Descriptor - MXL12835F */
        ( void ( * )( void ) ) 0x00000000, /* 0xFFFFFFFF to default 1-bit SPI mode  ;DevStrAdr */
        ( void ( * )( void ) ) 0x001820C2, /* mfgId + extCount */
        ( void ( * )( void ) ) 0x00000000, /* extid 0-3 */
        ( void ( * )( void ) ) 0x00000000, /* extid 4-7 */
        ( void ( * )( void ) ) 0x0001001D, /* caps */
        ( void ( * )( void ) ) 0x00000100, /* Blks + RESV1 */
        ( void ( * )( void ) ) 0x00010000, /* blkSize */
        ( void ( * )( void ) ) 0x00000000, /* subBlks + subBlkSize */
        ( void ( * )( void ) ) 0x00000100, /* pageSize + RESV2 */
        ( void ( * )( void ) ) 0x00003F00, /* maxReadSize */
        ( void ( * )( void ) ) 0x68506850, /* maxClkRate,maxReadRate,maxHSReadRate,maxProgramRate */
        ( void ( * )( void ) ) 0x06030050, /* maxHSProgramRate,initDeInitFxId,clearStatusFxId,getStatusFxId */
        ( void ( * )( void ) ) 0x14110F0B, /* setStatusFxId,setOptionsFxId,getReadCmdFxId,getWriteCmdFxId */
    #endif /* ifdef MXL12835F */
};                                         /* End of g_pfnVectors */

/****************************************************************************** */
/* Functions to carry out the initialization of RW and BSS data sections. These */
/* are written as separate functions rather than being inlined within the */
/* ResetISR() function in order to cope with MCUs with multiple banks of */
/* memory. */
/****************************************************************************** */
__attribute__( ( section( ".after_vectors.init_data" ) ) )
void data_init( unsigned int romstart,
                unsigned int start,
                unsigned int len )
{
    unsigned int * pulDest = ( unsigned int * ) start;
    unsigned int * pulSrc = ( unsigned int * ) romstart;
    unsigned int loop;

    for( loop = 0; loop < len; loop = loop + 4 )
    {
        *pulDest++ = *pulSrc++;
    }
}

__attribute__( ( section( ".after_vectors.init_bss" ) ) )
void bss_init( unsigned int start,
               unsigned int len )
{
    unsigned int * pulDest = ( unsigned int * ) start;
    unsigned int loop;

    for( loop = 0; loop < len; loop = loop + 4 )
    {
        *pulDest++ = 0;
    }
}

/****************************************************************************** */
/* The following symbols are constructs generated by the linker, indicating */
/* the location of various points in the "Global Section Table". This table is */
/* created by the linker via the Code Red managed linker script mechanism. It */
/* contains the load address, execution address and length of each RW data */
/* section and the execution and length of each BSS (zero initialized) section. */
/****************************************************************************** */
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

/****************************************************************************** */
/* Reset entry point for your code. */
/* Sets up a simple runtime environment and initializes the C/C++ */
/* library. */
/****************************************************************************** */
__attribute__( ( section( ".after_vectors.reset" ) ) )
void ResetISR( void )
{
    /* Disable interrupts */
    __asm volatile ( "cpsid i" );


    /* Enable SRAM clock used by Stack */
    __asm volatile ( "LDR R0, =0x40000220\n\t"
                     "MOV R1, #56\n\t"
                     "STR R1, [R0]" );

