FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/Projects/MCUXpresso/Startup/startup_lpc54018.c
    #if defined( __USE_CMSIS )
/* If __USE_CMSIS defined, then call CMSIS SystemInit code */
        SystemInit();
    #endif // (__USE_CMSIS)

    /* */
    /* Copy the data sections from flash to SRAM. */
    /* */
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int * SectionTableAddr;

    /* Load base address of Global Section Table */
    SectionTableAddr = &__data_section_table;

    /* Copy the data sections from flash to SRAM. */
    while( SectionTableAddr < &__data_section_table_end )
    {
        LoadAddr = *SectionTableAddr++;
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        data_init( LoadAddr, ExeAddr, SectionLen );
    }

    /* At this point, SectionTableAddr = &__bss_section_table; */
    /* Zero fill the bss segment */
    while( SectionTableAddr < &__bss_section_table_end )
    {
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        bss_init( ExeAddr, SectionLen );
    }

    #if !defined( __USE_CMSIS )
/* Assume that if __USE_CMSIS defined, then CMSIS SystemInit code */
/* will enable the FPU */
        #if defined( __VFP_FP__ ) && !defined( __SOFTFP__ )
            /* */
            /* Code to enable the Cortex-M4 FPU only included */
            /* if appropriate build options have been selected. */
            /* Code taken from Section 7.1, Cortex-M4 TRM (DDI0439C) */
            /* */
            /* Read CPACR (located at address 0xE000ED88) */
            /* Set bits 20-23 to enable CP10 and CP11 coprocessors */
            /* Write back the modified value to the CPACR */
            asm volatile ( "LDR.W R0, =0xE000ED88\n\t"
                           "LDR R1, [R0]\n\t"
                           "ORR R1, R1, #(0xF << 20)\n\t"
                           "STR R1, [R0]" );
        #endif // (__VFP_FP__) && !(__SOFTFP__)
    #endif // (__USE_CMSIS)


    #if !defined( __USE_CMSIS )
/* Assume that if __USE_CMSIS defined, then CMSIS SystemInit code */
/* will setup the VTOR register */

        /* Check to see if we are running the code from a non-zero */
        /* address (eg RAM, external flash), in which case we need */
        /* to modify the VTOR register to tell the CPU that the */
        /* vector table is located at a non-0x0 address. */
        unsigned int * pSCB_VTOR = ( unsigned int * ) 0xE000ED08;

        if( ( unsigned int * ) g_pfnVectors != ( unsigned int * ) 0x00000000 )
        {
            *pSCB_VTOR = ( unsigned int ) g_pfnVectors;
        }
    #endif // (__USE_CMSIS)
    #if defined( __cplusplus )
        /* */
        /* Call C++ library initialisation */
        /* */
        __libc_init_array();
    #endif

    /* Reenable interrupts */
    __asm volatile ( "cpsie i" );

    #if defined( __REDLIB__ )
        /* Call the Redlib library, which in turn calls main() */
        __main();
    #else
        main();
    #endif

    /* */
    /* main() shouldn't return, but if it does, we'll just enter an infinite loop */
    /* */
    while( 1 )
    {
    }
}

/****************************************************************************** */
/* Default core exception handlers. Override the ones here by defining your own */
/* handler routines in your application code. */
/****************************************************************************** */
WEAK_AV void NMI_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void HardFault_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void MemManage_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void BusFault_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void UsageFault_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void SVC_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void DebugMon_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void PendSV_Handler( void )
{
    while( 1 )
    {
    }
}

WEAK_AV void SysTick_Handler( void )
{
    while( 1 )
    {
    }
}

/****************************************************************************** */
/* Processor ends up here if an unexpected interrupt occurs or a specific */
/* handler is not present in the application code. */
/****************************************************************************** */
WEAK_AV void IntDefaultHandler( void )
{
    while( 1 )
    {
    }
}

/****************************************************************************** */
/* Default application exception handlers. Override the ones here by defining */
/* your own handler routines in your application code. These routines call */
/* driver exception handlers or IntDefaultHandler() if no driver exception */
/* handler is included. */
/****************************************************************************** */
WEAK void WDT_BOD_IRQHandler( void )
{
    WDT_BOD_DriverIRQHandler();
}

WEAK void DMA0_IRQHandler( void )
{
    DMA0_DriverIRQHandler();
}

WEAK void GINT0_IRQHandler( void )
{
    GINT0_DriverIRQHandler();
}

WEAK void GINT1_IRQHandler( void )
{
    GINT1_DriverIRQHandler();
}

WEAK void PIN_INT0_IRQHandler( void )
{
    PIN_INT0_DriverIRQHandler();
}

WEAK void PIN_INT1_IRQHandler( void )
{
    PIN_INT1_DriverIRQHandler();
}

WEAK void PIN_INT2_IRQHandler( void )
{
    PIN_INT2_DriverIRQHandler();
}

WEAK void PIN_INT3_IRQHandler( void )
{
    PIN_INT3_DriverIRQHandler();
}

WEAK void UTICK0_IRQHandler( void )
{
    UTICK0_DriverIRQHandler();
}

WEAK void MRT0_IRQHandler( void )
{
    MRT0_DriverIRQHandler();
}

WEAK void CTIMER0_IRQHandler( void )
{
    CTIMER0_DriverIRQHandler();
}

WEAK void CTIMER1_IRQHandler( void )
{
    CTIMER1_DriverIRQHandler();
}

WEAK void SCT0_IRQHandler( void )
{
    SCT0_DriverIRQHandler();
}

WEAK void CTIMER3_IRQHandler( void )
{
    CTIMER3_DriverIRQHandler();
}

WEAK void FLEXCOMM0_IRQHandler( void )
{
    FLEXCOMM0_DriverIRQHandler();
}

WEAK void FLEXCOMM1_IRQHandler( void )
{
    FLEXCOMM1_DriverIRQHandler();
}

WEAK void FLEXCOMM2_IRQHandler( void )
{
    FLEXCOMM2_DriverIRQHandler();
}

