FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/Projects/MCUXpresso/Startup/startup_lpc54018.c
WEAK void FLEXCOMM3_IRQHandler( void )
{
    FLEXCOMM3_DriverIRQHandler();
}

WEAK void FLEXCOMM4_IRQHandler( void )
{
    FLEXCOMM4_DriverIRQHandler();
}

WEAK void FLEXCOMM5_IRQHandler( void )
{
    FLEXCOMM5_DriverIRQHandler();
}

WEAK void FLEXCOMM6_IRQHandler( void )
{
    FLEXCOMM6_DriverIRQHandler();
}

WEAK void FLEXCOMM7_IRQHandler( void )
{
    FLEXCOMM7_DriverIRQHandler();
}

WEAK void ADC0_SEQA_IRQHandler( void )
{
    ADC0_SEQA_DriverIRQHandler();
}

WEAK void ADC0_SEQB_IRQHandler( void )
{
    ADC0_SEQB_DriverIRQHandler();
}

WEAK void ADC0_THCMP_IRQHandler( void )
{
    ADC0_THCMP_DriverIRQHandler();
}

WEAK void DMIC0_IRQHandler( void )
{
    DMIC0_DriverIRQHandler();
}

WEAK void HWVAD0_IRQHandler( void )
{
    HWVAD0_DriverIRQHandler();
}

WEAK void USB0_NEEDCLK_IRQHandler( void )
{
    USB0_NEEDCLK_DriverIRQHandler();
}

WEAK void USB0_IRQHandler( void )
{
    USB0_DriverIRQHandler();
}

WEAK void RTC_IRQHandler( void )
{
    RTC_DriverIRQHandler();
}

WEAK void FLEXCOMM10_IRQHandler( void )
{
    FLEXCOMM10_DriverIRQHandler();
}

WEAK void Reserved47_IRQHandler( void )
{
    Reserved47_DriverIRQHandler();
}

WEAK void PIN_INT4_IRQHandler( void )
{
    PIN_INT4_DriverIRQHandler();
}

WEAK void PIN_INT5_IRQHandler( void )
{
    PIN_INT5_DriverIRQHandler();
}

WEAK void PIN_INT6_IRQHandler( void )
{
    PIN_INT6_DriverIRQHandler();
}

WEAK void PIN_INT7_IRQHandler( void )
{
    PIN_INT7_DriverIRQHandler();
}

WEAK void CTIMER2_IRQHandler( void )
{
    CTIMER2_DriverIRQHandler();
}

WEAK void CTIMER4_IRQHandler( void )
{
    CTIMER4_DriverIRQHandler();
}

WEAK void RIT_IRQHandler( void )
{
    RIT_DriverIRQHandler();
}

WEAK void SPIFI0_IRQHandler( void )
{
    SPIFI0_DriverIRQHandler();
}

WEAK void FLEXCOMM8_IRQHandler( void )
{
    FLEXCOMM8_DriverIRQHandler();
}

WEAK void FLEXCOMM9_IRQHandler( void )
{
    FLEXCOMM9_DriverIRQHandler();
}

WEAK void SDIO_IRQHandler( void )
{
    SDIO_DriverIRQHandler();
}

WEAK void CAN0_IRQ0_IRQHandler( void )
{
    CAN0_IRQ0_DriverIRQHandler();
}

WEAK void CAN0_IRQ1_IRQHandler( void )
{
    CAN0_IRQ1_DriverIRQHandler();
}

WEAK void CAN1_IRQ0_IRQHandler( void )
{
    CAN1_IRQ0_DriverIRQHandler();
}

WEAK void CAN1_IRQ1_IRQHandler( void )
{
    CAN1_IRQ1_DriverIRQHandler();
}

WEAK void USB1_IRQHandler( void )
{
    USB1_DriverIRQHandler();
}

WEAK void USB1_NEEDCLK_IRQHandler( void )
{
    USB1_NEEDCLK_DriverIRQHandler();
}

WEAK void ETHERNET_IRQHandler( void )
{
    ETHERNET_DriverIRQHandler();
}

WEAK void ETHERNET_PMT_IRQHandler( void )
{
    ETHERNET_PMT_DriverIRQHandler();
}

WEAK void ETHERNET_MACLP_IRQHandler( void )
{
    ETHERNET_MACLP_DriverIRQHandler();
}

WEAK void Reserved68_IRQHandler( void )
{
    Reserved68_DriverIRQHandler();
}

WEAK void LCD_IRQHandler( void )
{
    LCD_DriverIRQHandler();
}

WEAK void SHA_IRQHandler( void )
{
    SHA_DriverIRQHandler();
}

WEAK void SMARTCARD0_IRQHandler( void )
{
    SMARTCARD0_DriverIRQHandler();
}

WEAK void SMARTCARD1_IRQHandler( void )
{
    SMARTCARD1_DriverIRQHandler();
}

/****************************************************************************** */

#if defined( DEBUG )
    #pragma GCC pop_options
#endif // (DEBUG)
